In [90]:
import pandas as pd
import os
import pandas as pd

pd.set_option('display.width', 500) # Set display width to 500, so that we can see the full table

In [91]:
# Specify the folder path containing your CSV files
folder_path = './'

# Initialize an empty dictionary to store DataFrames
dfs = {}

# Loop through files in the folder
for filename in os.listdir(folder_path):
    if filename.endswith('.csv'):  # Check if the file is a CSV file
        file_path = os.path.join(folder_path, filename)  # Get the full file path
        # Read the CSV file into a DataFrame and store it in the dictionary
        df_name = os.path.splitext(filename)[0]  # Use the filename (without extension) as the DataFrame name
        dfs[df_name] = pd.read_csv(file_path)

# Check the dictionary keys, line by line
for key in dfs:
    print(key)

US_CPI
US_10Y_treasury_yield
US_PMI
US_2Y_treasury_yield
US_3-month_T-bill_yield
Russell_2000
Russell_1000

In [92]:
# access to US_CPI
dfs['US_2Y_treasury_yield']

             DATE   DGS2
0      1976-06-01  7.260
1      1976-06-02  7.230
2      1976-06-03  7.220
3      1976-06-04  7.120
4      1976-06-07  7.090
...           ...    ...
12343  2023-09-22   5.10
12344  2023-09-25   5.09
12345  2023-09-26   5.04
12346  2023-09-27   5.10
12347  2023-09-28   5.04

[12348 rows x 2 columns]

In [93]:
for df_name, df in dfs.items():
    df.columns = df.columns.str.upper() # all-caps column names
    df['DATE'] = pd.to_datetime(df['DATE'], format='%Y-%m-%d') # convert date column to datetime
    print("DataFrame Name:", df_name)
    print(df.head())

DataFrame Name: US_CPI
        DATE  CPIAUCSL
0 1947-01-01     21.48
1 1947-02-01     21.62
2 1947-03-01     22.00
3 1947-04-01     22.00
4 1947-05-01     21.95
DataFrame Name: US_10Y_treasury_yield
        DATE DGS10
0 1962-01-02  4.06
1 1962-01-03  4.03
2 1962-01-04  3.99
3 1962-01-05  4.02
4 1962-01-08  4.03
DataFrame Name: US_PMI
        DATE PCUOMFGOMFG
0 1984-12-01       100.0
1 1985-01-01           .
2 1985-02-01           .
3 1985-03-01           .
4 1985-04-01           .
DataFrame Name: US_2Y_treasury_yield
        DATE   DGS2
0 1976-06-01  7.260
1 1976-06-02  7.230
2 1976-06-03  7.220
3 1976-06-04  7.120
4 1976-06-07  7.090
DataFrame Name: US_3-month_T-bill_yield
        DATE DGS3MO
0 1981-09-01  17.01
1 1981-09-02  16.65
2 1981-09-03  16.96
3 1981-09-04  16.64
4 1981-09-07      .
DataFrame Name: Russell_2000
        DATE        OPEN        HIGH         LOW       CLOSE   ADJ CLOSE     VOLUME
0 1987-09-10  167.440002  168.979996  167.440002  168.970001  168.970001  179800000
1 1987-09-11  168.970001  170.539993  168.750000  170.539993  170.539993  178000000
2 1987-09-14  170.529999  170.949997  170.149994  170.429993  170.429993  154400000
3 1987-09-15  170.419998  170.440002  169.130005  169.199997  169.199997  136200000
4 1987-09-16  169.309998  170.029999  168.820007  168.919998  168.919998  195700000
DataFrame Name: Russell_1000
        DATE        OPEN        HIGH         LOW       CLOSE   ADJ CLOSE  VOLUME
0 1992-12-10  232.500000  232.500000  231.009995  231.929993  231.929993     0.0
1 1992-12-11  231.929993  231.929993  231.279999  231.520004  231.520004     0.0
2 1992-12-14  231.520004  232.199997  231.070007  231.070007  231.070007     0.0
3 1992-12-15  231.070007  231.270004  230.460007  230.860001  230.860001     0.0
4 1992-12-16  230.860001  231.570007  229.850006  230.169998  230.169998     0.0

In [94]:
dfs['Russell_2000']

           DATE         OPEN         HIGH          LOW        CLOSE    ADJ CLOSE      VOLUME
0    1987-09-10   167.440002   168.979996   167.440002   168.970001   168.970001   179800000
1    1987-09-11   168.970001   170.539993   168.750000   170.539993   170.539993   178000000
2    1987-09-14   170.529999   170.949997   170.149994   170.429993   170.429993   154400000
3    1987-09-15   170.419998   170.440002   169.130005   169.199997   169.199997   136200000
4    1987-09-16   169.309998   170.029999   168.820007   168.919998   168.919998   195700000
...         ...          ...          ...          ...          ...          ...         ...
9081 2023-09-25  1768.670044  1788.030029  1766.540039  1784.239990  1784.239990  3195650000
9082 2023-09-26  1774.640015  1786.050049  1761.609985  1761.609985  1761.609985  3472340000
9083 2023-09-27  1771.160034  1786.599976  1765.640015  1778.900024  1778.900024  3875880000
9084 2023-09-28  1778.030029  1802.609985  1777.890015  1794.310059  1794.310059  3846230000
9085 2023-09-29  1805.469971  1809.689941  1781.050049  1785.099976  1785.099976  3865960000

[9086 rows x 7 columns]

In [95]:
# merge dfs according to the DATE column from each df
US_treasury_df = pd.merge(dfs['US_2Y_treasury_yield'], dfs['US_10Y_treasury_yield'], on='DATE', how='left').merge(dfs['US_3-month_T-bill_yield'], on='DATE', how='left')
US_treasury_df

            DATE   DGS2 DGS10 DGS3MO
0     1976-06-01  7.260  7.94    NaN
1     1976-06-02  7.230  7.94    NaN
2     1976-06-03  7.220  7.92    NaN
3     1976-06-04  7.120  7.89    NaN
4     1976-06-07  7.090  7.88    NaN
...          ...    ...   ...    ...
12343 2023-09-22   5.10  4.44   5.56
12344 2023-09-25   5.09  4.55   5.58
12345 2023-09-26   5.04  4.56   5.58
12346 2023-09-27   5.10  4.61   5.58
12347 2023-09-28   5.04  4.59   5.56

[12348 rows x 4 columns]

In [96]:
US_macro = pd.merge(dfs['US_CPI'], dfs['US_PMI'], on='DATE', how='left')
US_macro

          DATE  CPIAUCSL PCUOMFGOMFG
0   1947-01-01    21.480         NaN
1   1947-02-01    21.620         NaN
2   1947-03-01    22.000         NaN
3   1947-04-01    22.000         NaN
4   1947-05-01    21.950         NaN
..         ...       ...         ...
915 2023-04-01   302.918     248.583
916 2023-05-01   303.294     246.270
917 2023-06-01   303.841     245.843
918 2023-07-01   304.348     245.375
919 2023-08-01   306.269     251.216

[920 rows x 3 columns]

In [97]:
Russell = pd.merge(dfs['Russell_2000'], dfs['Russell_1000'], on='DATE', how='left', suffixes=('_Russell_2000', '_Russell_1000'))
Russell

           DATE  OPEN_Russell_2000  HIGH_Russell_2000  LOW_Russell_2000  CLOSE_Russell_2000  ADJ CLOSE_Russell_2000  VOLUME_Russell_2000  OPEN_Russell_1000  HIGH_Russell_1000  LOW_Russell_1000  CLOSE_Russell_1000  ADJ CLOSE_Russell_1000  VOLUME_Russell_1000
0    1987-09-10         167.440002         168.979996        167.440002          168.970001              168.970001            179800000                NaN                NaN               NaN                 NaN                     NaN                  NaN
1    1987-09-11         168.970001         170.539993        168.750000          170.539993              170.539993            178000000                NaN                NaN               NaN                 NaN                     NaN                  NaN
2    1987-09-14         170.529999         170.949997        170.149994          170.429993              170.429993            154400000                NaN                NaN               NaN                 NaN                     NaN                  NaN
3    1987-09-15         170.419998         170.440002        169.130005          169.199997              169.199997            136200000                NaN                NaN               NaN                 NaN                     NaN                  NaN
4    1987-09-16         169.309998         170.029999        168.820007          168.919998              168.919998            195700000                NaN                NaN               NaN                 NaN                     NaN                  NaN
...         ...                ...                ...               ...                 ...                     ...                  ...                ...                ...               ...                 ...                     ...                  ...
9081 2023-09-25        1768.670044        1788.030029       1766.540039         1784.239990             1784.239990           3195650000        2360.560059        2375.540039       2356.360107         2375.070068             2375.070068                  0.0
9082 2023-09-26        1774.640015        1786.050049       1761.609985         1761.609985             1761.609985           3472340000        2364.139893        2364.139893       2336.800049         2340.419922             2340.419922                  0.0
9083 2023-09-27        1771.160034        1786.599976       1765.640015         1778.900024             1778.900024           3875880000        2345.870117        2351.469971       2323.300049         2342.610107             2342.610107                  0.0
9084 2023-09-28        1778.030029        1802.609985       1777.890015         1794.310059             1794.310059           3846230000        2340.219971        2366.540039       2337.550049         2357.209961             2357.209961                  0.0
9085 2023-09-29        1805.469971        1809.689941       1781.050049         1785.099976             1785.099976           3865960000        2369.800049        2375.879883       2344.899902         2351.350098             2351.350098                  0.0

[9086 rows x 13 columns]